In [1]:
from climber_class import *

# User

We need to create a user with this same route features
- Grade
- Location
- Cluster
- Heigh

#### Climber atributes

In [2]:
climber_1 = climber('jordi',44,3,['rum','eidas','ajs niod'],165)
climber_2 = climber()
display(climber_1.get_data())
display(climber_2.get_data())

Climber class initialized
Climber class initialized

,climber_id,name,ascents,grade_fra,grade,grade_range,country,crag,sector,height
0,0,jordi,0,6b+/6c,44,3,rum,eidas,ajs niod,165

,climber_id,name,ascents,grade_fra,grade,grade_range,country,crag,sector,height
0,1,climber1,0,7b/+,54,2,esp,montserrat,agulla del senglar,170

In [3]:
climber_1.set_attributes(grade = 29)
climber_2.set_attributes(grade_range = 1)
display(climber_1.get_data())
display(climber_2.get_data())

,climber_id,name,ascents,grade_fra,grade,grade_range,country,crag,sector,height
0,0,jordi,0,5,29,3,rum,eidas,ajs niod,165

,climber_id,name,ascents,grade_fra,grade,grade_range,country,crag,sector,height
0,1,climber1,0,7b/+,54,1,esp,montserrat,agulla del senglar,170

#### For routes

In [4]:
routes = pd.read_csv('../data/routes_clustered.csv',low_memory=False, index_col=0)

In [5]:
climber_1.add_route_liked(routes.iloc[[13403]])
climber_1.add_route_not_liked(routes.tail(2))
climber_1.add_route(routes.head(1))
display("Routes liked:",climber_1.get_routes_liked())
print()
print()
display("Routes not liked:",climber_1.get_routes_climbed())

'Routes liked:'

,name_id,country,crag,sector,name,ascents_count,repeat_sum,recommend_sum,tall_recommend_sum,grade_mean,sentiment_mean,rating_mean,yellow_id_mean,first_ascent_mean,cluster,liked
13403,13403,esp,cuenca,fortin,packard bell,7,0.0,1.0,0,51.428571,0.0,2.142857,182.142857,0.0,1,Yes

'Routes not liked:'

,name_id,country,crag,sector,name,ascents_count,repeat_sum,recommend_sum,tall_recommend_sum,grade_mean,sentiment_mean,rating_mean,yellow_id_mean,first_ascent_mean,cluster,liked
13403,13403,esp,cuenca,fortin,packard bell,7,0.0,1.0,0,51.428571,0.0,2.142857,182.142857,0.0,1,Yes
0,0,and,montserrat,prohibitivo,el mehir,6,0.0,1.0,-1,49.000000,0.0,2.000000,0.000000,0.0,0,N/A
55085,55085,zaf,van stadens,the beach,sheathless,2,0.0,0.0,-1,39.500000,0.0,2.000000,255.000000,0.0,1,No
55086,55086,zaf,waterval boven,baboon buttress,pretenders,2,0.0,1.0,0,49.000000,0.0,NaN,255.000000,0.0,1,No

Is route already in?

In [13]:
climber_1.add_route_not_liked(routes.tail(100))

In [18]:
climber_1.add_route_liked(routes.head(100))

#### For clusters

In [94]:
climber_1.cluster

[100, -6, -2, 7, 1, 0, 0, 0, 0]

In [95]:
climber_1.get_cluster_order()

[0, 3, 4, 5, 6, 7, 8, 2, 1]

In [114]:
lst = climber_1.get_cluster_order()
[lst[len(lst)-idx-1] for idx in range(len(lst))]

[1, 2, 8, 7, 6, 5, 4, 3, 0]

In [110]:
len(lst)

9

In [9]:
climber_1.add_route_liked(routes.head(1346456))

In [10]:
climber_1.cluster

[22565, 22294, 1760, 7006, 1461, 0, 0, 0, 0]

In [11]:
climber_1.get_cluster_order()

[0, 1, 3, 2, 4, 5, 6, 7, 8]

In [12]:
climber_1.clear_routes()
display(climber_1.get_routes_climbed())

Empty DataFrame
Columns: [name_id, country, crag, sector, name, ascents_count, repeat_sum, recommend_sum, tall_recommend_sum, grade_mean, sentiment_mean, rating_mean, yellow_id_mean, first_ascent_mean, cluster, liked]
Index: []